oldprogram/nRF51822/1.77_spi_lcd_&&_flash/arm/include/ble_gap.h
/**@brief Start scanning (GAP Discovery procedure, Observer Procedure).
 * @note Not implemented, not valid in peripheral role.
 *
 * @param[in] p_scan_params Pointer to scan parameters structure.
 * @return NRF_ERROR_NOT_SUPPORTED.
 */
SVCALL(SVC_BLE_GAP_SCAN_START, uint32_t, ble_gap_scan_start(ble_gap_scan_params_t const * const p_scan_params));


/**@brief Stop scanning (GAP Discovery procedure, Observer Procedure).
 * @note Not implemented, not valid in peripheral role.
 *
 * @return NRF_ERROR_NOT_SUPPORTED
 */
SVCALL(SVC_BLE_GAP_SCAN_STOP, uint32_t, ble_gap_scan_stop(void));


/**@brief Create a connection (GAP Link Establishment).
 * @note Not implemented, not valid in peripheral role.
 *
 * @param[in] p_peer_addr   Pointer to peer address. If this is NULL, then the whitelist will be used to try to connect to one of the devices in it.
 * @param[in] p_conn_params Pointer to desired connection parameters.
 * @return NRF_ERROR_NOT_SUPPORTED
 */
SVCALL(SVC_BLE_GAP_CONNECT, uint32_t, ble_gap_connect(ble_gap_addr_t const * const p_peer_addr, ble_gap_conn_params_t const * const p_conn_params));


/**@brief Cancel a connection establishment.
 * @note Not implemented, not valid in peripheral role.
 *
 * @param[in] p_peer_addr   Pointer to peer address.
 * @return NRF_ERROR_NOT_SUPPORTED.
 */
SVCALL(SVC_BLE_GAP_CONNECT_CANCEL, uint32_t, ble_gap_connect_cancel(ble_gap_addr_t const * const p_peer_addr));


/**@brief Update connection parameters.
 *
 * @details If the central role this will initiate the connection parameter update,
 *          otherwise in the peripheral role, this will send the corresponding L2CAP request and wait for
 *          the central to perform the procedure. In both cases, and regardless of success or failure, the application
 *          will be informed of the result with a @ref BLE_GAP_EVT_CONN_PARAM_UPDATE event.
 *
 * @param[in] conn_handle Connection handle.
 * @param[in] p_conn_params  Pointer to desired connection parameters. If NULL is provided on a peripheral role,
 *                           the parameters in the PPCP characteristic of the GAP service will be used instead.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @return @ref NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.
 * @return @ref NRF_ERROR_BUSY Procedure already in progress or not allowed at this time, process pending events and retry.
 * @return @ref BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied.
 * @return @ref NRF_ERROR_NO_MEM Not enough memory to complete operation.
 */
SVCALL(SVC_BLE_GAP_CONN_PARAM_UPDATE, uint32_t, ble_gap_conn_param_update(uint16_t conn_handle, ble_gap_conn_params_t const * const p_conn_params));


/**@brief Disconnect (GAP Link Termination).
 *
 * @param[in] conn_handle Connection handle.
 * @param[in] hci_status_code HCI status code, see @ref BLE_HCI_STATUS_CODES.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.
 * @return @ref BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied.
 * @return @ref NRF_ERROR_INVALID_STATE Invalid state to perform operation (disconnect is already in progress).
 */
SVCALL(SVC_BLE_GAP_DISCONNECT, uint32_t, ble_gap_disconnect(uint16_t conn_handle, uint8_t hci_status_code));


/**@brief Set the radio's transmit power.
 *
 * @param[in] tx_power Radio transmint power in dBm (accepted values are -40, -20, -16, -12, -8, -4, 0, and 4 dBm).
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.
 * @return @ref NRF_ERROR_BUSY The stack is busy, process pending events and retry.
 */
SVCALL(SVC_BLE_GAP_TX_POWER_SET, uint32_t, ble_gap_tx_power_set(int8_t tx_power));


/**@brief Set GAP Appearance field.
 *
 * @param[in] appearance Appearance (16-bit), see @ref BLE_APPEARANCES.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @return @ref NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.
 */
SVCALL(SVC_BLE_GAP_APPEARANCE_SET, uint32_t, ble_gap_appearance_set(uint16_t appearance));


/**@brief Get GAP Appearance field.
 *
 * @param[out] p_appearance Appearance (16-bit), see @ref BLE_APPEARANCES.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 */
SVCALL(SVC_BLE_GAP_APPEARANCE_GET, uint32_t, ble_gap_appearance_get(uint16_t * const p_appearance));


/**@brief Set GAP Peripheral Preferred Connection Parameters.
 *
 * @param[in] p_conn_params Pointer to a PPCP structure with the desired parameters.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @return @ref NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.
 */
SVCALL(SVC_BLE_GAP_PPCP_SET, uint32_t, ble_gap_ppcp_set(ble_gap_conn_params_t const * const p_conn_params));


/**@brief Get GAP Peripheral Preferred Connection Parameters.
 *
 * @param[out] p_conn_params Pointer to a PPCP structure where the parameters will be stored.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 */
SVCALL(SVC_BLE_GAP_PPCP_GET, uint32_t, ble_gap_ppcp_get(ble_gap_conn_params_t * const p_conn_params));


/**@brief Set GAP device name.
 *
 * @param[in] p_sec_mode Write permissions for the Device Name characteristic see @ref ble_gap_conn_sec_mode_t.
 * @param[in] p_dev_name Pointer to an UTF8 string.
 * @param[in] len   Size of the buffer pointed to by p_dev_name, in octets.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @return @ref NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.
 * @return @ref NRF_ERROR_DATA_SIZE Invalid data size(s) supplied.
 */
SVCALL(SVC_BLE_GAP_DEVICE_NAME_SET, uint32_t, ble_gap_device_name_set(ble_gap_conn_sec_mode_t const * const p_sec_mode, uint8_t const * const p_dev_name, uint16_t len));


